import React from "react";
import { Link as BaseLink } from "react-router-dom";
import styled from "styled-components";

import BaseContainer from "../../atoms/Container";

import PageTemplate from "../PageTemplate";

const Container = styled(BaseContainer)`
	margin: 50px auto;
`;

const Title = styled.h1`
	font-size: 40px;
	margin-bottom: 10px;
`;

const SubTitle = styled.h2`
	font-size: 25px;
	margin-top: 30px;
	color: var(--main-color);
	margin-bottom: 10px;
	
`;

const Link = styled(BaseLink)`

	font-size: 15px;
	text-decoration: none;
	color: #5284DC;
	margin: 5px 0;
	font-weight: bold;

	&:hover {
		text-decoration: underline;
	}
`;

const P = styled.p`
	font-size: 17px;
`;

const PrivacyPolicyTemplate = () => (
	<PageTemplate>
		<Container>
			<section id="intro">
				<Title>سياسة الخصوصية</Title>
				<P>تقوم سياسة خصوصية The Arab Future (ويشار إليها هنا بـ "نحن" أو " نا الفاعلين ") بتوضيح البيانات التي نجمعها وكيف نقوم بإستخدامها لتقديم خدماتنا.</P>
				<br />
				<P>يرجى قراءة سياسة الخصوصية التالية بعناية قبل البدء في الاستخدام . </P>
				<br />
				<P>لكي تتمكن من استخدام خدماتنا ، يلزمنا الحصول على الموافقة منك على سياسة الخصوصية، وإذا كنت لا ترغب في الموافقة على سياسة الخصوصية، يجب عدم استخدام خدماتنا.</P>
				<br />
				<P>يجب ايضاً قراءة <Link to="/terms">شروط الخدمة</Link> التي توضح شروط استخدامك لخدماتنا وتقديمنا لها.</P>
			</section>
			<section id="changes">
				<SubTitle>التغييرات في سياسة الخصوصية</SubTitle>
				<P>قد نقوم بتحديث سياسة الخصوصية التالية في أي وقت.</P>
				<P>يجب عليك زيارة هذة الصفحة بانتظام في حالة تم تحديثها.</P>
			</section>
			<section id="collecting-information">
				<SubTitle>البيانات التي نجمعها</SubTitle>
				<P>يلزم لتقديم خدماتنا الحصول على بياناتك التي تقدمها لنا سواء خلالنا مباشرة او من خلال خدمات الطرف الثالث (Third-Party Services). </P>
				<br />
				<P><strong>البريد الإلكتروني (E-mail): </strong>عند إنشائك لحساب في خدماتنا, يجب تقديم البريد الاكتروني الخاص بك.</P>
				<br />
				<P><strong>اسم المستخدم (Username): </strong>عند إنشائك لحساب في خدماتنا, يجب تقديم اسم المستخدم الخاص بك.</P>
				<br />
				<P><strong>الصورة الشخصية و صورة الغلاف (Profile & Cover Pictures): </strong>بعد إنشائك حساب في خدماتنا, يمكنك تقديم صورة شخصية وصورة غلاف للعرض في ملفك الشخصي.</P>
				<br />
				<P><strong>السيرة الذاتية: </strong>بعد إنشائك حساب في خدماتنا, يمكنك تقديم سيرة ذاتية للعرض في ملفك الشخصي.</P>
				<br />
				<P><strong>ملفات تعريف الارتباط (Cookies): </strong>نحن نستخدم ملفات تعريف الارتباط لتشغيل خدماتنا وتقديمها، بما في ذلك تقديم خدماتنا التي تستند إلى الويب، وتحسين تجربتك وفهم كيفية استخدام خدماتنا.</P>
			</section>
			<section id="third-party">
				<SubTitle>معلومات الطرف الثالث (Third-Party)</SubTitle>
				<P><strong>خدمات الطرف الثالث: </strong>عند إنشائك لحساب في خدماتنا عن طريق احد خدمات الطرف الثالث (Facebook او GitHub), نقوم بتجميع البريد الالكتروني واسم المستخدم الخاص بك للإستخدام في حسابك و ملفك الشخصي.</P>			
				<br />
				<P><strong>بلاغات المستخدمين: </strong>مثلما يمكنك الإبلاغ عن مستخدمين آخرين، يجوز للمستخدمين الآخرين أيضًا إبلاغنا بتفاعلاتك على خدماتنا، وذلك للإبلاغ عن الانتهاكات المحتملة لشروطنا أو سياساتنا على سبيل المثال. وعند تقديم بلاغ، نجمع معلومات عن كل من المستخدم المُبلِّغ والمستخدم المُبلَّغ عنه. ولمعرفة المزيد حول ما يحدث عند إعداد بلاغ عن مستخدم. </P>
			</section>
			<section id="usage">
				<SubTitle>كيفية استخدامنا للبيانات</SubTitle>
				<P>نحن نستخدم البيانات التي توفرها لنا لتقديم خدماتنا وتشغيلها.</P>
				<br />
				<P><strong>خدماتنا: </strong>جميع البيانات التي تقدمها من اسم مستخدم و بريد الكتروني و الصورة الشخصية وصورة الغلاف والسيرة الذاتيه تُعرض على ملفك الشخصي, وعلى الأسئلة والإجابات التي تنشرها والمشاريع التي تمتلكها.</P>
				<br />
				<P><strong>السلامة والأمان: </strong>تعد السلامة والأمان والنزاهة جزءًا لا يتجزأ من خدماتنا. ونحن نستخدم المعلومات المتوفرة لدينا للتحقق من الحسابات والأنشطة، ومكافحة السلوكيات الضارة وحماية المستخدمين من التجارب السيئة والمحتوى المزعج وغير المرغوب به، وتعزيز السلامة والأمان داخل خدماتنا ، وعلى سبيل المثال من خلال التحقيق في الأنشطة المشبوهة أو حالات انتهاك شروطنا وسياساتنا، وضمان استخدام خدماتنا بطريقة قانونية.</P>
			</section>
		</Container>
	</PageTemplate>
);

export default PrivacyPolicyTemplate;