import React from "react";
import { Link as BaseLink } from "react-router-dom";
import styled from "styled-components";

import BaseContainer from "../../atoms/Container";

import PageTemplate from "../PageTemplate";

const Container = styled(BaseContainer)`
	margin: 50px auto;
`;

const Title = styled.h1`
	font-size: 40px;
	margin-bottom: 10px;
`;

const SubTitle = styled.h2`
	font-size: 25px;
	margin-top: 30px;
	color: var(--main-color);
	margin-bottom: 10px;
	
`;

const Link = styled(BaseLink)`

	font-size: 15px;
	text-decoration: none;
	color: #5284DC;
	margin: 5px 0;
	font-weight: bold;

	&:hover {
		text-decoration: underline;
	}
`;

const P = styled.p`
	font-size: 17px;
`;

const UL = styled.ul`
	margin: 30px 50px 30px 0;
`;

const LI = styled.li`
	font-size: 17px;
	margin-bottom: 10px;
`;

const TermsOfServiceTemplate = () => (
	<PageTemplate>
		<Container>
			<section id="intro">
				<Title>شروط الخدمة</Title>
				<P>تنطبق الشروط التالية على استخدامك لموقع The Arab Future (ويشار إليها هنا بـ "نحن" أو " نا الفاعلين ") سواء كضيف أو مستخدم مسجل.</P>
				<br />
				<P>يرجى قراءة الشروط التالية بعناية قبل البدء في الاستخدام.</P>
				<br />
				<P>لكي تتمكن من استخدام خدماتنا، يلزمنا الحصول على الموافقة منك على الشروط الواردة، وإذا كنت لا ترغب في الموافقة على الشروط التالية، يجب عدم استخدام خدماتنا.</P>
				<br />
				<P>توضح <Link to="/privacy-policy">سياسة الخصوصية</Link> المعلومات التي نقوم بتجميعها منك وكيف نقوم باستخدامها.</P>
			</section>
			<section id="changes">
				<SubTitle>التغييرات في شروط الخدمة</SubTitle>
				<P>قد نقوم بتحديث الشروط التالية في أي وقت.</P>
				<P>يجب عليك زيارة هذة الصفحة بانتظام في حالة تم تحديثها.</P>
			</section>
			<section id="registeration">
				<SubTitle>التسجيل</SubTitle>
				<P><strong>البيانات: </strong>يجب إنشاء حساب للحصول على خدماتنا عبر استخدام بيانات دقيقة، ويجب أن تكون بياناتك الشخصية لائقة للعرض العام.</P>
				<br />
				<P><strong>العمر: </strong>يجب أن تبلغ ١٣ عاماً لإنشاء حساب في خدماتنا، وفي حالة أنك لم تبلغ السن الذي يخولك الموافقة على شروطنا في بلدك أو منطقتك، فيجب على والدك / والدتك أو ولي أمرك الموافقة على شروطنا نيابة عنك. ولذا عليك أن تطلب من والدك / والدتك أو ولي أمرك قراءة هذه الشروط معك.</P>			
			</section>
			<section id="usage">
				<SubTitle>الاستخدام المقبول لخدماتنا</SubTitle>
				<P><strong>شروط الخدمة: </strong>يجب أن تستعمل خدماتنا بحسب شروط الخدمة، وإذا انتهكت شروطنا أو سياستنا، يجوز لنا اتخاذ إجراء بخصوص حسابك، بما في ذلك تعطيل حسابك أو تعليقه، وفي حال قيامنا بذلك، فإنك توافق على عدم إنشاء حساب.</P>			
				<br />
				<P><strong>الاستخدام القانوني: </strong>يجب عدم استخدام خدماتنا سوى للأغراض القانونية والمعتمدة والمقبولة، فلا يحق لك استخدام (أو مساعدة الآخرين على استخدام) خدماتنا بطرق: </P>			
				<UL>
					<LI>تنتهك الحقوق الخاصة بنا أو مستخدمينا أو أشخاص آخرين، بما في ذلك حقوق الخصوصية وحقوق الدعاية أو حقوق الملكية الفكرية الأخرى أو تستولي أو تتعدى عليها.</LI>
					<LI>غير قانونية أو غير أخلاقية أو مسيئة للسمعة أو تهديدية أو تخويفية أو تنطوي على مضايقة أو تحض على كراهية عنصرية أو عرقية أو تحرض أو تشجع على سلوك غير قانوني أو غير ملائم ، مثل الترويج لجرائم العنف ، أو تعريض الأطفال أو غيرهم للخطر.</LI>
					<LI>تتيح الاشتراك في نشر الأكاذيب أو المعلومات المحرفة أو البيانات المضللة.</LI>
					<LI>تنتحل هوية شخص ما.</LI>
				</UL>
				<P><strong>الحفاظ على أمان حسابك: </strong>تتحمل وحدك مسؤولية الحفاظ على أمان حسابك ، ويجب عليك إبلاغنا في الحال عند تعرض حسابك لاختراق أمني.</P>
			</section>
			<section id="third-parties">
				<SubTitle>خدمات الطرف الثالث</SubTitle>
				<P>قد تتيح لك خدماتنا الوصول إلى أو استخدام أو التفاعل مع مواقع أو تطبيقات أخرى مثل (فيسبوك أو جوجل) والتي تكون مدمجة مع خدماتنا، فنحن نوضح لك أن هذه الشروط وسياسة الخصوصية الوارة لدينا لا تسري إلا على استخدامك لخدماتنا، وعند استخدامك لمنتجات أو خدمات تابعة لأطراف ثالثة، سوف تسري شروط وسياسات خصوصية هذه الجهات على استخدامك لهذه الخدمات.</P>
			</section>
			<section id="licenses">
				<SubTitle>التراخيص</SubTitle>
				<P><strong>حقوقك: </strong>المعلومات التي تقدمها في حسابك من خلال خدماتنا من حقك وتحت مسؤوليتك وليس لنا الادعاء بملكيتها، ونحن غير مسؤولين عن مصدرها.</P>
				<br />
				<P><strong>حقوقنا: </strong>جميع حقوق النشر والنطاقات والشعارات والمظهر التجاري ذات الصلة بخدماتنا، فلا يحق لك استخدام حقوق النشر أو النطاقات أو الشعارات أو حقوق الملكية الفكرية الأخرى التابعة لنا، ما لم تحصل على إذن صريح منا بذلك.</P>
				<br />
				<P><strong>الترخيص الذي تمنحه لنا: </strong>أنت تمنحنا ترخيصًا لاستخدام المعلومات (بما في ذلك المحتوى) التي تقوم بتقديمها أو تخزينها أو إرسالها أو تلقيها على خدماتنا أو عبرها، وإعادة إنتاجها وتوزيعها وإنشاء أعمال مقتبسة منها وعرضها واستخدامها، ويتم استخدام الحقوق التي تمنحها في هذا الترخيص لأغراض محددة تتعلق بتشغيل خدماتنا وتوفيرها (مثل السماح لنا بعرض صورتك في الملف الشخصي والسيرة الذاتية الخاصة بك وأسئلتك ومشاريعك).</P>
			</section>
			<section id="liability">
				<SubTitle>إخلاء المسؤولية والإعفاء منها والحد منها</SubTitle>
				<P>أنت تستخدم خدماتنا على مسؤوليتك الشخصية وتخضع لنصوص إخلاء المسؤولية التالية:</P>
				<br />
				<P>- نحن نوفر خدماتنا " كما هي" من دون أي ضمانات صريحة أو ضمنية ، على سبيل المثال لا الحصر، عدم انتهاك الحقوق والملكية والخلو من فيروسات الكمبيوتر أو الرموز البرمجية الضارة الأخرى ، فنحن لا نضمن أن تكون أية معلومات نوفرها دقيقة أو مكتملة أو مفيدة وأن خدماتنا ستكون قابلة للتشغيل أو خالية من الأخطاء أو آمنة أو أن خدماتنا ستكون قادرة على العمل من دون انقطاعات أو تأخيرات أو عيوب ، نحن لا نتحكم في كيفية أو توقيت استخدام مستخدمينا لخدماتنا أو الخصائص والخدمات والواجهات التي توفرها خدماتنا ، كما أننا غير مسؤولين عن ذلك . ونحن غير مسؤولين عن التحكم في التصرفات أو المعلومات الصادرة عن مستخدمينا أو الأطراف الثالثة الأخرى ، كما أننا غير ملزمين بذلك . أنت تعفينا من أي خلاف أو نزاع أو أضرار ، بما في ذلك اي خلاف أو نزاع أو أضرار تقوم بها.</P>	
				<br />
				<P>نحن لا نتحمل مسؤولية تجاهك عن أية خسائر في الأرباح أو أية أضرار أخرى تنشأ بسبب شروطنا أو بسببنا أو بسبب خدماتنا أو تتعلق أو تتصل بها بأي شكل من الأشكال.</P>
			</section>
		</Container>
	</PageTemplate>
);

export default TermsOfServiceTemplate;